[
  {
    "id": "155567804.what-happens-now",
    "title": "What happens now?",
    "body": "There’s been so much chatter about LLMs, Generative AI, and data that I’ve had friends, former colleagues, and LinkedIn connections reach out asking:\n“What happens to data and analytics teams now that we’re in the AI era?”\nIt’s a great question—one I’ve spent the past year or two thinking about as I’ve tested these tools myself.\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.\nWhat Are LLMs Good At?\nFrom my experiments, LLMs are great at generating human-like text, summarizing topics, and answering questions\nquickly\n. They excel when the information already exists: spotting simple patterns, providing broad insights at scale, and contextualizing answers with a wide range of knowledge.\nBut LLMs aren’t perfect. They’re prone to errors, occasionally hallucinating facts or confidently delivering answers that just aren’t accurate. They struggle with nuance, lack precision for highly specific queries, and can’t think outside the box—they give you only what you ask for.\nIn a way, they’re like an entry- to mid-level analyst: capable of basic tasks and summaries but not yet ready for strategic problem-solving or novel insights.\nWhat Are LLMs Bad At?\nLLMs falter when asked to think critically, connect dots outside their training, or reason beyond their scope. They’re not “problem solvers” in the traditional sense. Instead, they act as mirrors of your queries: garbage in, garbage out. And while they can automate repetitive or boring tasks, don’t expect them to replace human creativity or advanced reasoning anytime soon.\nA Test: Baby Data\nAs a parent to a 3-year-old and a data geek at heart, I kept meticulous logs of feedings, diaper changes, sleep patterns, and more during my child’s first 8 months. (Yes, I’m\nthat\nparent—don’t ask my partner about my monthly financial budgets!) I always planned to analyze the data but never found the time.\nRecently, I tested an LLM on this data to see if it could surface patterns or insights I hadn’t thought of. The results were… underwhelming. While the LLM could summarize trends and answer basic questions, it couldn’t handle the context, reasoning, or creativity required to make the insights actionable. It’s a reminder that these tools still need humans to connect the dots and deliver value.\nMy take having experimented with these for the past 1-2 years:\nCurrent capabilities mean analysts/data scientists are not going to be redundant  within the next few years (hopefully?)\nAutomate the boring stuff - have it write the annoying stuff\nOnly as good as the prompts - like a entry/mid-level analyst - if will give you only what you ask but do not expect novelty / advanced reasoning\nLack of SQL / Analytical\ncode online is contributing to the inability for these bots to build end-to-end solutions\nFollow along as I keep trying to get this going!\nSo, What Happens Next?\nAnalytics Teams Shift from Reporting to Business Research\nToday, Analytics Teams often get stuck in a cycle of building dashboards and answering repetitive ad hoc questions. LLMs are rapidly automating many of these operational queries which opens the door for Analytics Teams to focus on\nBusiness Research\n—the art of exploring \"why\" something happened that demands more complex reasoning and \"what to do next”.\nRather than just reporting numbers, analysts will tackle deeper, more strategic questions:\nWhy are specific segments churning?\nWhat untapped markets should we explore?\nHow can product usage trends shape our roadmap?\nThe focus will shift from describing the past to influencing the future. Analytics will become about\nhypothesis generation, strategy, and driving decisions\n, blending business acumen with advanced reasoning.\nData Engineering Teams Build Data Products for LLMs\nData Engineering, too, is evolving. Traditional roles like ETL pipelines and warehouse management will give way to creating\ndata products\noptimized for AI. These include curated datasets, embeddings, semantic layers, and feature stores that ensure LLMs get high-quality inputs. This will help make their impact 10x because they will build the ‘democratized data’ engine for the 80% of use-cases that can leverage everyday data with lower levels of accuracy.\nFor SaaS businesses, this could mean:\nData Products/Services\n: Designed with quality checks and controls to fuel LLMs.\nSemantic Layers\n: Enriching data with contextual text so LLMs can provide richer, more nuanced responses.\nObservability\n: Tools to monitor data freshness and accuracy for LLM use.\nThe goal is to structure data so it is simple, context-rich, and ready for advanced AI tools to analyze. In this new world, Data Engineers won’t just move data; they’ll ensure it’s architected to be actionable and impactful.\nHow to Prepare for the Future of Analytics\nTo adapt to this new era, teams and organizations should:\nUpskill\n: Train Analytics Teams on business research techniques and Data Engineers on AI-focused data product design.\nFocus on Quality\n: Identify areas where 80% accuracy is “good enough” for decision-making and let LLMs handle these tasks.\nExperiment\n: Start testing LLMs now. Explore where they work well, where they fall short, and where trade-offs make sense.\nMy Ask to You\nWhat have you experimented with? What’s worked—and what hasn’t? I’d love to hear your take on how you’re using LLMs and Generative AI in your work. Drop your thoughts in the comments! Let’s figure out the future of analytics together.\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "149790317.where-did-all-the-analysts-go",
    "title": "Where did all the analysts go?",
    "body": "Where Did All the Analysts Go?\nI’ve previously written about how analytics teams need to operate like internal product teams—building roadmaps, prioritizing their work, and delivering value iteratively. At one point, I even considered starting a regular\nblog\nseries about this. (Spoiler: spending my limited free time writing about analytics instead of doing it wasn’t exactly a hit with my significant other.)\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.\nStill, one question keeps popping up in conversations:\nWhere did all the analysts go?\nThe Bus Stop of Careers\nYou might disagree (and my own career certainly proves otherwise), but I subscribe to the concept of the\n100x analyst\n. That is, most great analysts don’t stay in analytics forever—it’s a bus that people hop onto and eventually jump off into other roles. That might not be novel - but I suspect data people will have even more career optionality moving forward.\nGood analysts are those rare \"\npurple people\n\" who blend technical skills with business acumen and storytelling. They’re the ones who create analyses so impactful that they shift your perspective or influence a decision in a profound way. Think of any insight you got where it actually changed your perspective, it was novel, unique.\nA great analyst leverages technical skills, understands the business, and crafts a persuasive narrative to confirm or challenge conventional wisdom. It’s a delicate balance: some lean more technical, others excel in business understanding, and some are exceptional storytellers. But the best analysts bring enough of all three to the table, prioritizing good-enough in all areas instead of perfect in any one.\nIf you’re an analyst, it’s worth reflecting:\nWhat do I enjoy doing the most?\nWhere do I spend my time learning and growing?\nWho’s in a role I admire?\nWhere can I make the most impact?\nMy Perspective: Impact, Learning, and Growth\nRecently, two members of my team transitioned into new roles. While it’s always bittersweet to see talented individuals leave, as a leader, it’s also one of the most rewarding outcomes. My personal barometer for success is simple:\nAre people making an impact, learning, and growing?\nWhy that order? Because without making an impact, learning and growth often lack depth and direction. For example, you might pick up new business knowledge (like understanding RevOps) or technical skills (like exploring ML), but if you’re not applying them to shape tangible outcomes—whether that’s influencing pricing decisions, identifying a key market, or improving retention rates—does it really matter?\nPractical application amplifies learning and opens doors. It’s what stretches you and drives\ncollective success\n. With the rise of generative AI and LLMs, my advice to analysts is to focus on the impact you can make. The learning and growth will naturally follow because you’ll be motivated to solve real problems that push your limits.\nSo.. Where Do Analysts Go?\nThe short answer:\neverywhere.\nAnalytical mindsets are increasingly valuable across industries, especially with today’s rapid advancements in technology. The ability to reason, structure problems, and communicate insights is a superpower (and one I certainly do not pretend to have ever mastered).\nThe longer answer is that analysts often move into roles where they can continue to apply their skills to drive even more impact in the areas they are passionate about:\nProduct Management\n: Transitioning from analyzing user behavior to shaping product roadmaps.\nStrategy\n: Moving into roles that define company priorities and initiatives.\nOperations\n: Applying insights to optimize processes and drive efficiency.\nMarketing\n: Using data to craft campaigns and measure their success.\nLeadership\n: Scaling impact by building and managing teams.\nWhere you go depends on your passions and the skills you want to hone. Start with what excites you and where you can make the biggest difference. The rest will follow.\nThe Analyst’s Legacy\nAt its core, analytics is about driving better decisions that impact the company - no one department or team. Whether you stay in the field or move into something new, the principles that make analysts great—curiosity, rigor, and communication—will always serve you well.\nSo, where do analysts go? Anywhere they want to make an impact.\nHere’s some typical paths I’ve seen analysts take:\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "149789681.metrics-that-matter",
    "title": "Metrics that Matter",
    "body": "With everyone drowning in data - why are we often chasing the wrong metrics?\nThe common allure on the quest of being “data-driven” is to choose big numbers that mean little - essentially vanity metrics to be sold for consumption. Everyone throws a list together of the top 10, no let’s make it 20 - metrics that will give us the best reading of what is going on in the business. By the time the metrics get agreed upon, created and are able to be digested, that person moves on and we rinse/repeat the cycle all over again. It is something I’ve seen so commonly in my career.\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.\nVanity metrics are those that look impressive (line go up!) but do not provide any action on driving growth, improving product, optimizing operations, enhancing customer experience or profitability. Some common metrics are:\nTotal Number of Users\nTotal Open Pipeline\nCustomer Count\nTotal Bookings\nGrowth Rate\nSprint Velocity or Completion Rate\nWhy?\nThey lack any context for action - sure they can be used for external reporting, but do they influence the success of the business? In isolation (especially in pretty powerpoint presentation) - what are you supposed to do with a slide that shows Total Bookings? Is that good, is it bad - even if we hit target, are we okay? I previously said something like..\n…so why aren’t the metrics leading to a discussion? There could be a lot of reasons.  Here are some of the reasons I’ve observed:\nMetric Fatigue\n: With 25+ metrics—say, five key metrics for every major department—none of them are fully understood in terms of what they are telling the business. Too much data creates noise and confusion.\nSystems Thinking\n: Metrics often have inherent relationships, especially across departments. For example, marketing’s lead generation metrics directly impact sales pipeline health, which in turn affects revenue. Without understanding these relationships, metrics lose their strategic value.\nTough Discussions\n: Metrics that matter often surface uncomfortable truths. They highlight areas of underperformance or misalignment, which can make people hesitant to engage deeply with them. They also create visibility where market dynamics impact performance more than any departmental effort.\nWhy Fewer Metrics Are Better\nYou might think tracking\nmore\nmetrics is better (every department and team gets metrics!), but in reality, it’s the opposite. Too many metrics create noise, dilute focus, and overwhelm. Here’s why fewer metrics that matter win:\nClarity Drives Action\nA company with 20 KPIs will leave everyone paralyzed. A clear focus on 3–5 key metrics makes it obvious what matters and where to act. These should change as priorities change.\nAligns the Organization\nWhen teams rally around the same critical metrics, it’s easier to prioritize, collaborate, and move the needle. A bloated set of company<>department<>team metrics creates competing priorities and misalignment. I would even go so far as to say team / departmental metrics do not matter at all and contribute to this confusion (is your primary value-add to the company, department or team?)\nHighlights What Matters Most\nFewer metrics force you to prioritize leading indicators that actually move the business forward. It’s about quality over quantity. Does focusing on the number of tickets completed or sprint burn-rate matter when Activation Rate or Pipeline Created is underperforming?\nBut which Metrics?\nI have a bias towards leading indicators - which are forward-looking metrics that predict future performance and help you make proactive decisions. They guide strategy, identify opportunities, and warn of risks. For example:\nCustomer Onboarding Success Rate\n: Tracks how many new customers complete key activation milestones (e.g., setting up a profile, integrating, creating users).\nUsage Trends\n: Measures how frequently customers engage with high-value features, predicting retention or churn risk.\nPipeline Velocity\n: Shows how quickly opportunities move through your sales funnel, highlighting areas for improvement (with the caveat that this really depends on stage of company and market - if you are in a niche/emerging industry this is less meaningful as part of your sales funnel is\nmarket annealing\n)\nLeading indicators are inherently actionable. They point to specific levers people can pull to influence outcomes, unlike lagging indicators that only show what already happened.\nExamples of Metrics That Matter in SaaS\nHere’s my opinionated view on critical metrics:\nQLVR\n(Qualified Lead Velocity Rate): Why? Your marketing efforts should translate to higher quality leads over-time.\nPipeline-to-Close Rate\n: Why? Revenue teams need to focus on efficiency in deal conversions - how are they building repeatable sales processes? With the caveat that this is a key metric in an established market with a known large SAM. For niche companies in\nemerging or nascent markets - this is a less valuable metric because of\nmarket annealing\n.\nActivation Rate\n: Why? Customers should reach the product’s value quickly, driving retention and future upsell/cross-sell. Folks not using the product are a key leading indicator of future revenue performance and retention.\nGross Margin Retention (GMR)\n: Why? Keeps the focus on profitable growth by filtering out the noise of gross revenue numbers.\nMost-Valuable Employee Retention\n: Why? MVEs can be critical to innovation and performance (depending on the business and talent pool) - especially hard to acquire skillsets or experience. Depending on the size of your company, domain space and industry - MVE Retention can be a leading indicator of company performance or technological stagnation (eg our best AE just left - does that mean accounts are fully penetrated?)\nHow to Find Your Metrics That Matter\nReady to streamline and focus on what counts? Follow these steps to identify actionable, impactful metrics:\n1.\nStart with Goals\nDefine your business objectives clearly - with the help of your analysts ;) Are you driving retention? Increasing acquisition? Improving operational efficiency? The right metrics will directly align with these goals.\n2.\nPrioritize Leading Indicators\nChoose metrics that provide early warnings or signals. For example, instead of tracking overall churn (a lagging indicator), measure leading indicators like drops in product usage or engagement.\n3.\nUse RAG Visuals to Drive Action\nImplement Red-Amber-Green (RAG) visuals to make dashboards immediately actionable. For instance:\nRed\n: Critical—needs immediate attention.\nAmber\n: Needs monitoring but not urgent.\nGreen\n: Performing well—no action needed.\nRAG visuals eliminate guesswork, helping users know where to focus first.\n4.\nIterate and Evolve\nMetrics aren’t static. Regularly revisit your KPIs to ensure they are correctly defined, still align with your strategy and adapt to changes in the business.\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "141220673.what-am-i-looking-at-and-what-am",
    "title": "What am I looking at and what am I supposed to do?",
    "body": "The famous hockey-stick. Always be concerned when you see the hockey-stick.\nIf you’re in analytics and you have never gotten this question - stop, email me and I will give you the keys to the substack.\nIf you are like the rest of us.. you’ve gotten asked this on more than one occasion and gone through the painstaking experience of having 5 different people give you wildly different feedback on the same visual, each one of them contradicting the other while lacking substance. It might go something like…\n“I need the numbers in a table”\n“Can we put this in a line graph?”\n“This would be better in a bar chart”\n“Can you just tell me what I need to do?”\nBut all you care about is -\ndo you understand what is happening\n? Your success as an analytics person is achieving “a picture says a thousand words”. Visualizations should have immediate impact (has anyone ever told you how to understand a heart rate monitor? yet you know). Ideally, metrics and KPIs are the heart rate of the business, department or product team that anyone can ‘view’ and quickly form\na shared understanding\nto drive action\n. In perfect execution it is less time talking about what the data is showing and more time discussing what needs to be done. Some of my learnings are:\nSimple - both in the number of metrics, metric definition and visualization. Keeping it as simple as possible will enable more people to understand and think about how they take action.\nLeading - make sure the metrics are actually controllable and that actions taken will have an impact within a set timeframe\nTransparent - metrics that are are simple and leading yet not available to the broadest set of users means there is no shared reality on how individual efforts contribute to success\nWhile an analytics team might have a perspective on what action needs to be taken (purely as a recommendation) they are not the operators actually taking the action. Since every use-case could be different, the primary task needs to be driving consistency around the what, to create a conversation around the why, and lead to action.\nObservations\nGoogle Trends, Grafana, Datadog, and other applications are popular, widely understood and used - they are simple and digestible. They show simple trends - line go up, line go down, line stays flat. While I cringe saying this, Analytics Teams cannot\nanneal\nusers into understanding a *gasp* box-plot or *scream* dual-line-chart. It simply is not an effective use of time, and I don’t mean that condescendingly, I say that with full respect and understanding of most internal company users. In my prior post I provided an example of building an analytical product for Account Executives. Understanding that these Users livelihood is determined on the number of calls they are on, relationships being built and deals they land - it is unreasonable to expect that type of User to deep-dive into a dashboard, research how to interpret a chart, and then think about what they need to do. It is always best to assume that people need the quickest snippet of insights.\nWhich is why as an analytics person throughout my career I have had to come to terms with RAG (Red-Amber-Green) and building Health Scores - even if some part of me dislikes them.\nKeeping it simple\nWhile I consider this the first step to get folks to understand data or insights, it is important to note that RAG observability should be done for metrics that are known to be leading indicators - because you want people to take action on things\nbefore\nthey become a problem. For instance, setting a RAG observability on Revenue is not meaningful - you already either did or did not close the deals. It also does not give anyone the ability to actually do anything (“Should I back-post those Opportunities?”) - you are measuring a lagging indicator! RAG observability on something (theoretically) like customer engagements, product usage, credit status, etc are all leading indicators of what is likely to happen with a renewal - thus helps you achieve your lagging indicator of Revenue. If an Account Executive has declining customer engagements, product usage, etc - it is clear action needs to be taken.\nA shared understanding\nWhile the nuance of what leading indicators should be measured could be a whole separate post (idea?), an analytics team needs to have nebulous yet\ndeeper\nconversation of “what are the metrics that matter - what are the leading indicators?” and vigorously debate, research, experiment and test them. This will help create the shared understanding of why metrics are being measured, the value they provide and potential actions that need to be taken. And while this can often be the longest, daunting and excruciating conversations - it is the most impactful - it is consensus. When everyone agrees on the metrics that matter, we can then start to codify the actions into Process and Systems.\nExtending the Account Executive example, we have enough data to run a natural experiment using a Revenue Intelligence Platform (like Gong) and see a cohort of Account Executives lead to higher deal sizes and more product usage. They have common features like positive conversational markers, engagement frequency, engaging Solutions Architecture, etc. If we have the shared understanding - these are the metrics that lead to better deals - the next step is creating RAG observability of these metrics for every Account Executive and putting these learnings into your go-to-market playbook to replicate it across your salesforce. This up-levels the entire salesforce to replicate known successes and focuses on the leading indicators the team can control that should lead to better outcomes (eg higher deals and more usage).\nMake no mistake, that example is the ideal state but you can only get there with the shared understanding - What are the problems? Why are they happening? What do we need to do about it? This is how you drive action and how RAG observability dashboards are an instrumental piece in getting there.\nAside - I’m still working out the kinks and always open to feedback, feel free to drop me a comment, email rklauder@gmail.com or text on what is/is not working.\nLeave a comment\nWhy Me?\nI think about all of the amazing analysts out there, stuck in a ticketing queue every day doing the soul sucking work of ripping out deliverables while having no material influence on the quality, speed or impact of decisions. My hope is that this can be a place Analytical Thinkers can realize the strategic role they play and how they will be even more important as data, AI and LLMs become prevalent.\nSubscribe now\nI’m hoping on sharing more thoughts weekly, would love for you to subscribe to help me quantify how folks are enjoying this :pray-hands:",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "140986311.do-something-anything",
    "title": "Do something, anything",
    "body": "“This is what the data shows”\nI firmly believe that data and analytics is really about aligning on information which leads to better discussions, which leads to better decisions, which leads to better outcomes. The best analysis or dashboard simply drives people to think or consider something - it is an amalgamation of events or experiences. One of my favorite rants on the importance of data is from Kevin Systrom and his experience of cooking\nThanksgiving Dinner\nand extrapolating it to early usage of Instagram. You only need to watch 4min to get the meat of the story but in brief, was dinner (or early Instagram) really that good *qualitative* if people didn’t eat (or use) it *quantitative*? It is a story that keeps me in the function, the data led to the right discussions, decisions and outcomes on product direction (which was different than what users\nsaid\n). Which is why I started writing this.\nMethods\nI previously wrote about analytics teams needing to\noperate like product teams\n- how they can measure themselves with Adoption (Active Users) and Retention (Recurring Usage) to dashboards. Like the Thanksgiving Dinner story, Adoption and Retention are important because they show that you are building the right analytical workflows that are helping drive cultural changes (“omg, we’re data driven!”). Let’s take an example - you are an analyst working in the traditional ticketing queue getting multiple requests during a big quarter from multiple Account Executives, all of them titled “Urgent: Renewal next month, how is Customer 123 using ProductA?\".\nBoiling that into a User Story might sound like “As an Account Executive, I want to understand how my customer is using our product so that I can better understand risk, upsell or cross-sell.”\nGreat - you have your User Story. In the most optimistic state, you know where all the data is, you have it properly architected and have a rough-idea of what you want to do. At this point - you just need to build it.\nExcept, it is probably a good time to do more user research. First you need to understand:\nWhat is their overall job-to-be-done?\nWhat is the workflow of the typical User?\nWhat information do they think is useful and why?\nHow will they use this information?\nAnalyst thinking to themselves when Stakeholder says “I just need the list of users and accounts” without any other details or even specifying which users or accounts.\nAnswering this helps you identify what Action are you trying to drive Users to. Let’s play out the example:\nUser Story: “As an Account Executive, I want to understand how my customer is using our product so that I can better understand risk, upsell or cross-sell. I need to know how they are using the product so that when I reach out to customers 90 days before their contract expires, I can better position my sales strategy. I need to know Active Users, engagement with\nCore Features\nso that Users are getting value, etc etc etc. When I know this I can better understand if an account could get upsold, cross-sold, or might churn/contract.”\nEven better - now you have more context to the User Story, understand the workflow and can provide other meaningful insights. The action you want to drive Account Executives to is understanding upsell/cross-sell/churn/contraction risk. At this stage, you could (\nshould\n) do a quick design mock-up (pick any, every company is creating a design tool these days) and facilitate feedback from Users (eg Account Executives).\nFast forward, mock ups looked good, you’ve got the dashboard built, you rolled out to beta users, made adjustments - did a whole internal slack launch, booked enablement sessions. Few weeks later, adoption and retention look great. You created a roadmap of feature enhancements to this workflow you’ve built and will constantly build. :green-check-mark: You did it.\nBut how can you be sure you actually drove action or that Users took action?\nA conundrum\nYou cant. There’s probably so many confounding variables (When did the User view the information relative to the Opportunity getting created/closed? What were the attributes of the customer or deal? How does this relate to historical account and user behavior? If analytics helped, shouldn’t they get some of that sweet sweet commishy? - uh, yes?)\nBut you’re saying - there has to be a way! Maybe? Let’s create a company token system (this has actually been proposed by someone but :yawn: I cannot find the link) or measure quality of discussions (how many mention “the data”) or quality of decisions (would love to see that study) or quality of relationships (people saying you rock?). Besides you knowing you shouldn’t spend all of your time trying to measure your own self-worth, the administrative burden alone would bankrupt teams\ncompanies\n. The qualitative nature of defining the impact of an analytics team is why being on an analytics team is difficult and transitioning to an analytical product mindset even more difficult.\nTraditional Product Teams get to do all of this but then their Users get monetized, they can point to “Revenue grew X, Users grew Y” - $ being the market signal of insight/action/usefulness of the product.\nAnalytics Teams do all of this but have no value signal to their work - at least quantitatively. If we measure Usage and Retention - sure, we have a proxy for value (in the Attention Economy :wink: ), but that does not show action. If anything, within some indeterminate timeframe, Analytics Teams will have supported better decisions that (should) have made the company perform better but I don’t know about measuring causality there. (Open to any suggestions!)\nThe conundrum of analytics teams is that for being a heavily quantitative function, they are the most difficult to measure effectiveness quantitatively. Which is why it is so tempting to stay in ticketing queues and scrum processes.\n“How many tickets did we execute this week?\n“How many story points did we work on?”\n“How many stakeholders did we support”\nAs if these things quantify the value when in reality they don’t actually matter because none of them mean you worked on the high impact opportunities or solved user problems - they are all subjective. This creates another conundrum - Analysts usually want those dopamine hits (eg closing out dozens of ad hoc request tickets) because building something that you don’t know will be used and even if it does - you’ll never know the impact of can be demoralizing at best, vulnerable at least.\nPhoto by\nTorsten Dederichs\non\nUnsplash\nto demonstrate how the journey ahead is treacherous (who am I kidding..)\nThe road ahead and a higher calling\nDo something, anything. Do what you believe will be meaningful and lead to better discussions, better decisions, better outcomes. You are your own start-up with your own product, embarking on a journey building for a TAM you know of. The only failure is the status quo - in operations hell. A lot of this is subjective based on the maturity of the analytics team and company writ large.\nAs for some departing thoughts, I believe analytics teams should\nonly value the speed\nat which decisions (which should be better) are made. Although that is nebulous and impossible to administratively measure - if you feel compelled to understand how to measure impact or action, here’s some ideas based on maturity:\nData Informed —> Adoption and Retention because you need to get people to start to actually look at data and information.\nData Driven —> How many ‘strategic’ meetings are you or your team being requested to be a part of? How many Roadmap items has your team supported? Is there any performance gaps because Users didn’t have data? This indicates the culture is changing and the team is having an impact and are more quantifiable without the administrative burden.\nData Transformed —> Number of data-derived alerts actioned (a future post to chat about a world where you build internal alerting for relevant teams :eyes). Number of users exporting data or building dashboards because this indicates Users want to explore and provide their own insights (outside of analytical products and instead are requesting data products, which is a whole other topic).\nQualitatively, if you want to think about the impact you are making:\nDo you think the quality of decisions being made are\nimproving\n?\nAre there better discussions happening? (especially between key teams)\nDo people talk about what “the data” is showing them?\nAside - I’m still working out the kinks and always open to feedback, feel free to drop me a comment, email rklauder@gmail.com or text on what is/is not working.\nLeave a comment\nWhy Me?\nI think about all of the amazing analysts out there, stuck in a ticketing queue every day doing the soul sucking work of ripping out deliverables while having no material influence on the quality, speed or impact of decisions. My hope is that this can be a place Analytical Thinkers can realize the strategic role they play and how they will be even more important as data, AI and LLMs become prevalent.\nSubscribe now\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.\nI’m hoping on sharing more thoughts weekly, would love for you to subscribe to help me quantify how folks are enjoying this :pray-hands:\nThanks for reading Analytical Thoughts Substack! Subscribe for free to receive new posts and support my work.",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "140791399.analytical-thoughts",
    "title": "Analytical thoughts...",
    "body": "Why?\nReflecting on my career, I feel incredibly privileged to have witnessed and been a part of, what I like to call, the Excelification of businesses. Over the past decade, nearly everyone in every position has had to understand the basics of data and analytics - even if they don’t know it.\nHave a tab? That’s a data table. Have a column? That’s a field name. Have a cell? That is a value. Create a pivot and create a chart? Now you’re getting into analytics.\nThanks for reading Analytical’s Substack! Subscribe for free to receive new posts and support my work.\nWhile every company says they want to be ‘data-driven’, leverage ‘advanced analytics’, be on the forefront of AI/ML/GenAI/[insert next trend or acronym] - the simple is most businesses could be significantly improved if they used even the most basic of analytical techniques to be more directionally accurate. Many teams crave data, yet often rely on ad hoc requests for data, reports, or analysis that often become duplicative. While companies and employees want to be more informed by the metrics, most Analytics Teams cannot make the impact they need to because of how they operate.\nWhere we’ve been\nFrom my experience and in chatting with folks in the community, Analytics Teams typically get thrown into the standard operating model of a ticketing queue. Have a request? Throw it into Jira, we’ll get stack rank, prioritize and we get back to you on which sprint we can execute.\nInternal Customers waiting for “that list of users and accounts”\nBecause Analytics teams are typically viewed as support functions, there is often the organizational perspective to be a pseudo Data/ReportGPT for every request as well as complete every ticket,\nquickly\n(because we are agile!). And while I one day hope GenAI takes away the monotonous work, it is\nvery clearly far away\nwhich means Analytics teams still need to deliver value but continue to get stuck in the vicious cycle of ad hoc requests > lack of capacity > lack of strategy > lack of impact.\nTo be clear, I’m not saying this is wrong, requests should get collected - but not every request should be executed on and Analytics teams need to be diligent of quality vs quantity, impact vs effort, long-term vs short-term.\nInternal customers realizing I’m saying we will not give them the list of users and accounts\nAn Anecdote and aside\nIn most tech companies\nProduct Managers\nreceive feature requests, feedback, or requirements and their job is to stack rank priorities while empathetically understanding customers and strategically thinking about how to serve them novel solutions. They understand the Job-to-Be-Done, think about workflows and work with the product team to ship delightful experiences for people to be better with a product than they were without it.\nTypical Product Teams consist of a Pod made up of a Product Manager, Engineer (Manager+ICs), Product Designer, Product Analyst and Product Marketer which work together to build/ship/enable products that people love. They work in planning cycles where the Product Manager sets a strategy that blends the customer needs with the company vision and objectives to build those lovely products. Engineers architect, build and ship the product. Designers ensure it is engaging, frictionless and accessible. Marketers ensure users are enabled, educated and getting value.\nProduct Managers view of how people see them\nAnalytics Teams typically comprise of .. an Analyst (and maybe some Data Engineering support). For all intents and purposes though, they are a\nblend\nof a Product Teams functions.\nGathering Requirements and understanding JTBD/Workflow? → Product Manager\nArchitecting + Building a solution? → Product Engineer\nDashboard/Analysis design? → Product Designer\nSelling, cross-functionally sharing and enabling the dashboard/analysis? → Product Marketer\nWhere we need to go\nTo make an Analytics program as effective as possible, Analysts need to understand customers, their JTBD, have a vision and build analytical products (dashboards, reports, etc) that will make an impact.\nAnalytics teams need to transition from ‘support’ functions - executing on ticketed, ad hoc requests or decision support to analytical product teams. They need to build analytical products that create data-informed decisions and workflows to mature how companies operate. They should measure Adoption (usage), Retention (continued usage) and Expansion (feature enhancements) of their products to ensure they are making an impact.\nWhy Me?\nI think about all of the amazing analysts out there, stuck in a ticketing queue every day doing the soul sucking work of ripping out deliverables while having no material influence on the quality, speed or impact of decisions. My hope is that this can be a place Analytical Thinkers can realize the strategic role they play and how they will be even more important as data, AI and LLMs become prevalent.\nThanks for reading Analytical’s Substack! Subscribe for free to receive new posts and support my work.\nThanks for reading Analytical’s Substack! Subscribe for free to receive new posts and support my work.\nSubscribe now\nThanks for reading Analytical’s Substack! Subscribe for free to receive new posts and support my work.\nI’m hoping on sharing more thoughts weekly, would love for you to subscribe to help me quantify how folks are enjoying this :pray-hands:\nLeave a comment",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "140791382.coming-soon",
    "title": "Coming soon",
    "body": "This is Analytical Thoughts Substack.\nSubscribe now",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "140791381.how-to-use-the-substack-editor",
    "title": NaN,
    "body": "Hi! This is a draft post. Did you know that there are a bunch of nice formatting options in this editor? For example:\nBlock quotes are a nice way to put a quote or excerpt from a source. They make it clear that it is a quote.\nOf course, you can also do\nbold,\nitalic\n,\nlinks\n,\nand all that good stuff.\nHeadings and Embeddings\nYou can have headings in posts. Just use the “Style”\nlist in the toolbar. You can also embed different types of content. To add an image, just drag it in here or use the image selector tool in the toolbar.\nFor a tweet, YouTube video, Vimeo video, Spotify track, or SoundCloud embed, just paste the relevant link on a new line (don’t grab the embed code; it won’t work).\nHamish McKenzie\n@hamishmckenzie\nTwitter is an amazing tool and an awful place.\n3:40 PM ∙ Dec 15, 2017\n5\nLikes\n1\nRetweet\nTo delete a post, click on the\nSettings\nbutton (just to the left of Publish), and scroll down and find the delete button.\nPublishing Changes\nYou have two publishing options:\nPublish\n– this publishes your post only to the web.\nPublish & Send\n– this publishes your post to the web and at the same time sends the post out by email.\nNote: Once you have sent an email out, the only way to send it again is to create an entirely new post. Any edits you make to a post that has already been published will only be reflected on the web. So, there’s no need to worry about accidentally spamming your subscribers with repeat emails.\nFinally, if you import posts from some other site’s archives, you can backdate them so they are published in the correct order and associated with the correct publication dates. To do so, after you have published a post, go into that post’s Settings (just to the left of the Publish button) and select the desired date.\nIf you have any questions, you can check out our\nHelp Center\nor\ncontact support\n!",
    "tags": [
      "general",
      "thoughts"
    ]
  },
  {
    "id": "waves-and-webs-part-1",
    "title": "Waves and Webs: Rethinking Innovation",
    "body": "<div>\n<p>﻿WAVES AND WEBS</p>\n<p>As you look to the ocean, imagine consecutive and infinite waves - building, rolling, and crashing. Each wave has its small part in the wave before and after it, leaving remnants of its strength and disruption. I imagine technological innovation in the same way, consecutive waves building, rolling, and crashing. Each crash creates foamy disorientation for the people, governments, and markets to concentrate on the innovation, business models, and rules of engagement. The beginning of each s-curve in the building phase of the nascent, albeit exponential, tech innovation. In this stage, perception of disruption, progress, and adoption appears linear. As you roll through this perception from early adoption, the rate of change begins to rise and everything is disrupted. Just as soon as you adjust to the rapid change, the wave starts to plateau and crash. While the water recedes, the next wave gathers its strength… That is where I believe we are right now. This is my attempt to determine what is the shoreline, the washout, and paddling out.</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-2",
    "title": "Atlantic vs Pacific: A Tale of Mindsets",
    "body": "<div>\n<p>Working in the data world for as long as I have, thinking analytically and loving a good story naturally leads me to dive deeper. It means that I’m always looking for the patterns and underlying ‘why’ behind what I see happening. I became enamored with this idea of market orientations, demographics, and innovation trends. It’s been a combination of how VCs look at businesses (via my own professional experience), top-tier VC investment flows (Y Combinator, Tiger Global, A16z), and researching emergent Web3 technologies. It’s been a culmination of articles, podcasts, videos, and books I’ve read over the past few years that have resulted in a fundamental shift in my perspective.</p>\n<p>I apologize in advance for all of the conjecture, I haven’t had enough time to fully document and annotate. It’s difficult to reflect on which media type formulated these ideas so take it all in grains and grays.</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-3",
    "title": "The Great Migration of Talent",
    "body": "<div>\n<p>Assumptions before reading:\n* You know what Web 1, 2, and 3 means (if not, pls google)[a]\n* You have a general sense that software engineering/development is not an easy career to move into. There is a high barrier to entry and the abstract knowledge needed is concentrated on a finite talent pool.\n* You generally understand the concept of white vs blue-collar jobs and understand what commodities are (for intents and purposes I think of unskilled labor as commodities). Think of White Collar, Blue-Collar and Commodities in terms of their value and complexity:\n   * White-collar (highly-skilled/most difficult) provides the highest value with low supply\n   * Blue-Collar (semi-skilled/medium difficulty) provides moderate value with moderate/high supply (depending on the s-curve phase)\n   * Commodity (low skilled, low to no difficulty) provides moderate/low value with high supply. Something to note, commodities by nature are usually concentrated to highly competitive (and therefore low margin or income) and appear to be susceptible to contractor/part-time workforces as well as incentive-based pay as opposed to salary.\n* You generally understand that a lot (and most likely the majority) of the ‘bleeding edge’ tech community lives in California (for various reasons that we will get into)\n* You have heard about blockchain and AI (but you don't need to know too much about the specifics and nuances of them)\n* You know that the biggest tech companies (as of the last decade which is considered the Web2 era) are generally Facebook, Apple, Amazon, Netflix, Google, etc. An assumption I have is that they are fundamentally only enterprise Web2 companies with an innate inability to transition to Web3 (which we are on the cusp of). The recent regulatory scrutiny and efforts to create ‘walled gardens’ by these Enterprise Web2 companies are indicative of increased competition as their technological innovations have peaked/crashed ( at top of s-curve). You’ve seen a convergence of portfolios and products by these Enterprise Web2 companies as well as a ‘rubbing of elbows’ with each other in their respective markets (eg podcasts, video, streaming, devices, etc). This has created a format war as they seek to create technological barriers, ‘Walled Gardens’, or ‘moats’,  that lock in users and customers into their platforms/ecosystems.\n* Entrenched legacy companies and business models create incentives for innovation and thereby disruption. For myriad reasons (public markets and financial regulation, increased competition, organizational maturity) companies create ‘walled gardens’ and ‘moats’ that are diametrically opposed to the original mission or value at the beginning of each innovation wave. In the latest example, the Web2 era has incentivized and created these interoperability problems which Web3 seeks to disrupt. Web2 companies cannot lead these innovations because they are fundamentally counter to their business models and entrenched market positions. While some may shift, most will not. My thoughts are that there could be a fundamental shift in business models for Web3 (that favor public, social transactions of value) that could have some semblance to contemporary and prior business models but will almost be entirely new.\n* Open Source Technology development has largely been funded at the individual level, through VCs or through Web2 Enterprise Companies.\n* Technological evolutions largely move in Waves however thinking conceptually, there are these Webs connecting previous Waves. This is demonstrated with Web2 companies providing the ability for Enterprise Web1 to survive because these Enterprise Web1 companies have the budget and balance of trade leverage needed to fund Web2 companies. You will see the same happen with Web3 (for example Web1 Verizon teaming with Web2 Google and Apple for software/hardware during the Web2 era). What this means is that as the most recent wave builds, market positioning starts to occur with the balance of trades and partnerships between previous waves primarily due to infrastructure and capital.\n* My theory is that technological innovation is primarily centered on improving the network performance of humanity. From the printing press, trains, cars, internet, social media, etc the broadest and disruptive technologies have all been rooted in one way or another to improve the transmission of information. As these innovations have been adopted, the world has appeared to become more complex (or dense). Thinking of it this way, the world is performing more like a network that mirrors our online interactions. In many ways, our Offline-to-Online (OTO) lives are the most deeply connected they have ever been. As the perceived complexity of reality (Offline) grows (with political structures, corporate structures, career skill sets, etc), it is imagined that the digital (Online) complexity increases as well.</p>\n<p>Phase\n\tWeb1\n[b]\t\nWeb2\n[c]\t\nWeb3\n[d]\t\nRole Type\n\tNon-Tech\n\tTech\n\tNon-Tech\n[e][f]\t\nTech\n\tNon-Tech\n\tTech\n[g]\t\nWhite Collar\n\tMarketing/Sales/Services\n\tSoftware Engineering\n\tMarketing\n[h][i]\t\nSoftware Engineering\n\tMarketing\n\tSoftware Engineering/AI\n[j]\t\nBlue Collar\n\tFinance\n\tWeb Dev\n\tSales/Services\n\tData/Analytics\n\tSales\n\tAI/ML\n[k]\t\nCommodity\n\tManual Labor</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-4",
    "title": "The A-Player Cascade",
    "body": "<div>\n<p>Finance\nWeb Dev\n\tData Engineering\n\tSales/Services\nFinance\n\tData/Analytics\nData Engineering\n[l]</p>\n<p>Assumptions on History and Thoughts\n* A ‘Mindset’ Novella\n   * Atlantic\n      * Thinking of the settlement of the East Coast of America, one could characterize it by short, waypoint-like travel. Established settlements evolved into cities across the east that became dense and bustling. These cities largely grew and built off of the Industrial Revolution by incorporating disruptive technology (combustion engine) into the economy. Innovations were largely incremental or waypoint-like improvements that were quickly copied and spread which led to increased competition.  By and large, from the 40s-90s New York reigned supreme as a financial hub but also an innovation center for utilities, both of which quickly faced intense competition. What is key to think about is that the settlement and development of the Atlantic Coast resemble incremental improvements brought on by increased competition in dense (or saturated) markets. In this way, I define this as an “Atlantic Mindset”.\n   * Pacific\n      * Expansion of America to the West Coast was primarily driven by the desire for more opportunity - pioneering new or better ways of life. This coalesced into the migration to the Pacific Coast. The West Coast is characterized by long distances both figuratively and literally. Three states make up the entire West Coast while there are more than double across the East Coast. Anecdotally, it took a great deal of effort and grit to go westward as well as endurance because its geographic location isolated it from the East Coast, Europe, and Asia. While many moved west in search of gold, you don't really see a big influx of population until the flight from the more urban East Coast cities during the 70s-90s. Despite this, the premise remains the same - people searching for new opportunities and pioneering new ways. Out of play from the Finance and Utility industries thousands of miles away, innovations would need to be centered around scalability which led to less competition and more market concentrations. What is key to think about is how the settlement and survivability of the westward expansion were far-reaching, exploratory, and discovery. In this way, I define it as a “Pacific Mindset”.\n* The Great Knowledge Migration and Concentration\n   * New York and Financial Engineering\n      * While New York would be known as the epicenter of finance, business, and networking; it was truly incremental changes to existing creations. Finance innovations took what has been done for decades (if not centuries) and incrementally improved them to include M&As, Stock manipulations, derivatives, financing models, etc. which were conceptually new waypoints. The competition was fierce in this era because it was primarily based on capital manipulations or infrastructure upgrades that could be replicated and adapted relatively quickly. During the ‘80s and ‘90s, finance was the premier industry where most of the smartest minds made lots of money to figure out the best way to game the economic machine. Technical innovation to ‘feed the beast’ that was Wall Street (limit downtime, improve trade/communication speeds, improve resiliency). This primarily led to massive investments (public and private) into finance companies (which manipulated capital), utilities (which built the physical infrastructure for Wall Street), and data/network (which vastly increased flows and volume). Even with these technological adoptions, from a macro perspective, New York had its downsides in frequent disruptive weather events, legacy infrastructure, seasonal weather variability, established social, socioeconomic, and political classes; all of which were maintenance-heavy. The story I see is that as technology evolved into Web1, innovations were adopted primarily to improve finance companies, utilities, and data/network performances. What you see in the Web2 era is that those industries (but mostly finance and data/network) by and large became Marketing/Sales/Services oriented because most of it could be automated. To exemplify this, think more specifically about ETFs which by and large provide better returns (after cost) than actively managed funds. That analysis and market adoption was proved after extensive research on historical data used from Web1 and Web2 investment platforms to allow widespread adoption. In my mind what this also showed us that the financial innovations during this time were incremental and not truly revolutionary because the value creation was linear (look at S&P 500 growth) which is also a result of increased competition. True ownership multipliers, therefore, lie in the innovation and creation of new markets through new technologies (which often come with higher risk levels that public markets and public funds cannot accept).\n   * Silicon Valley and Software Engineering\n      * The true innovation was happening in California where a “Pacific mindset” of pioneering took hold. A lot of this was possible because of an expansive metropolitan area that allowed for less competition (think of Thiel and his views on monopolies in Zero to One[m]) which allowed for breakthroughs in the practical use of R&D (which were largely protected from outright, direct competition) as well as the ability to test these technological breakthroughs with less downtime from storms/power outages. Since this technological pioneering had broad and revolutionary applications, there was a flurry of talent and money to cash in (from a refined Finance industry that had become incestuous searching for yields). The first sign of how truly revolutionary this technology was (and how fragmented from reality the Finance industry’s perspective on it was) is to look at the Dot Com bubble/burst. A truly revolutionary technology went live but the market propensity to understand the implications was so far removed that it resulted in a classic bubble. However, what this truly did was to supercharge the coming Web revolution that would survive Web1, evolution to Web2, and expected Web3 revolution. As Sean Parker famously said to a young Mark Zuckerburg “You have to move to California” which is exactly what has happened not only to tech VCs, but all of the most well-known tech staff, executives, and founders. The West Coast (and more specifically California) has had the brightest and most innovative minds for most of the Web1 and practically all of the Web2 evolution. With a focus on pioneering (Pacific Mindset). Is there any wonder why ‘software is eating the world’ and ‘disrupt everything’ became rallying cries? In this perceived (but in some ways - actual) utopia, growth was unprecedented because the technological innovations were unprecedented and occurred at a rapid pace. Web1 tech companies (Microsoft, AOL, Yahoo, etc) became the legacy players that became disrupted and eaten by Web2 (Apple, Google, Amazon, etc). As with every wave, came a significant shift in the job market as skill sets quickly became either outdated or completely automated in the  Blue Collar/White Collar/Commodity table. Tech and Non-Tech Blue Collar jobs that carried even moderate labor costs were quickly automated (commoditized) and what couldn't, carried over to the Web2 Tech/Non-Tech Blue Collar jobs. All the while through Web1 and Web2, the West Coast (and more specifically San Francisco) has been and will continue to be the epicenter for technical innovation. The bleeding edge tech revolution will continue to stay on the West Coast while the East Coast (and middle America) will battle to take the scraps.\n* A 10x Jobs Theory\n   * “Steve Jobs used to say, to the point we all got sick of hearing it: “A players attract A players. B players attract C players.” This was in the context of making each new hire count, from the most junior to the most senior, regardless of role.” - Jim Walsh. This concept has been universally adopted by the biggest and best tech companies. Even Netflix’s Reed Hastings famously said “the best is easily 10x better than average”, which really echoes Jobs' original theory. Not only does this theory seem to have been a large reason for why top talent has become and will remain concentrated, but it’s also why PE firms, recruiting companies, and the like have all implemented psychometrics as part of the hiring funnel. Why? Enterprise Web2 and Web3 companies have and will continue to sap top engineering, data, and finance talent from the market as Jobs’ “A following A theory” continues to play out. Think about it, if you were one of the brightest in your industry, your greatest potential is to work with the brightest of the brightest, therefore to work on truly challenging and revolutionary work, you will go where the brightest are. What this top talent concentration has done is create the need for mid/low tier companies to try to weed out the remaining As from the marketplace, in futile attempts to build top tier technology/companies to be acquired. Vista has very famously implemented Criteria Corps CCAT which classifies individuals into A, B, C, and D based on their critical thinking skills and problem-solving ability among other attributes. Vista primarily looks to buy, pump and dump companies but after implementing these psychometrics to attract top tier firms to buy. As I have seen personally with every portfolio company, they do a pre/post-acquisition CCAT analysis of leadership and staff, broken out by Tech and Non-Tech positions. From my reading, most of the top-tier companies either recruit based on Referrals (following the A follows A theory) or those that pass psychometric tests (which discovers stray As in the marketplace). Based on this info, a concentration of A people in tech companies will likely continue as A attracts A in Enterprise Web2 and emerging Web3 but also as more firms implement psychometrics and become even more selective in their hiring processes.\n* Network Effects\n   * America/Europe/Asia as it relates to tech phases[n]\n      * From what I’ve seen, a lot of the tech innovations typically flow from the West Coast to the East and end in China[o]. While China has significantly improved its tech standings, it has not proven itself to be a pioneer in Web3 technologies (though it is catching up in AI).[p]\n   * Data and technological phases of companies (ACID, BASE, SALT)\n      * Looking at different structured and unstructured databases, they have generally followed different transaction principles: ACID (the 70s-00s), BASE (00s-10s), and SALT (10s-now)[q][r]. What I’ve seen is that tech companies appear to get stuck at database transaction principles they lived off of during their Web era which limits their ability to evolve for the next Wave. Looking at Legacy Web1 companies (Verizon, SAP, Oracle, Microsoft, etc) they primarily used ACID constrained database transactions which shaped and limited their abilities to innovate into the needs of Web2. Google, Facebook, Amazon primarily utilized BASE-constrained database transactions because that was what was needed for Web2 and their business models however this created the use-case for SALT which is indicative of Web3 and blockchain. What is striking is that companies' existing business models appear to mirror their database transaction principles which constrain them from a ‘Zero to One’ innovation. Web1 prized Accuracy, Consistency, and Isolation of transactions however this inhibited scalability of those systems which is why Microsoft, Oracle, Salesforce built database and software moats that did not allow for interoperability because of the fidelity of transactions was paramount. Their business models reflected this as they mostly did not allow data off-platform and had custom development languages (T-SQL, Oracle SQL, and SOQL) and inflexible database technology (Eg OBIEE, SQL Server, SF Objects) that did not provide the tools necessary for a more dynamic, fast-paced Web2. Looking at Web2, more specifically - Google, Amazon, and Facebook fundamentally needed BASE transaction constraints because transaction availability and soft state adaptability were needed as data volumes increased exponentially and performance needed to scale with growth. However, the inconsistency and soft state create distrust which does not allow for interoperability out-of-ecosystem (or out of the walled garden) which is why blockchain (SALT) has become more important. What SALT provides is distributed performance with higher levels of data fidelity and trust between transactions that address ACID and BASE gaps. Therefore distributed and open source is contrary to and addresses the gaps in ACID (Web1) and BASE (Web2) database transaction models. Fundamentally I believe databases and database transactions are closely (if not at the core) of how tech businesses in each Wave are modeled because optimizing transactions allows for companies to break paradigms and unlock rent-seeking value from the previous Wave. Since database performance is at the core of the system and network performance (because it represents information fidelity, throughput, and market demands), technological innovations will lead and inform Web business models in each Wave.\n   * Network Complexity as it relates to skills and White/Blue Collar jobs/innovations (too tired…[s][t][u])\n* Web2 as it evolves to Web3\n   * Web2 companies are mostly all publicly traded companies. This fundamentally shifts their business interests and ability to throttle P&L to spend on R&D which will not allow them to lead Web3 innovation. Shareholders’ demands for profitability and the corporatization of these organizations come at a time when their product ecosystems are rubbing elbows (and increasing competition in format war) which further reduces profit margins as price and not technology become competitive advantages. These companies are already starting to throw out their Web2 armistice agreements, reduce labor costs, improve profitability and create ‘walled gardens’ because Web3 will fundamentally disrupt their business models. Therefore the most successful Web2 companies will either be/go private (so that they can incur these painful changes and adapt) or they will drastically improve profitability to try to buy their way into Web3 (the way Microsoft has been able to survive Web1 to Web2) and/or own and provide the infrastructure (Cloud/Computing/Own Data). With the Jobs Theory of “A follows A”, the smartest engineers will start to pursue Web3 development and you can already see this happening as top talent flees these tech companies and Enterprise Web2 companies shift to hiring sprees for tech/non-tech blue-collar positions (Services, Sales, Data Analysts, Program Managers, etc).\n   * Web3 companies will be funded by Web2 founders, innovators, and winners (both individuals and VCs) that will create a new class of Web3 tech monopolies. This includes Jack Dorsey, Elon Musk, A16z, Y-Combinator, Tiger Global, etc. Enterprise Web2 companies will create strategic alignments and balances of trade with Web3 companies to protect moats while Web3 companies generate the revenues for growth and get scalable infrastructure.\n   * Cryptocurrency is a funding mechanism for blockchain development in Web3 because these companies (largely open-source organizations) fundamentally cannot go public. It mirrors the Dot Com bubble in that its implications are not clearly understood and business cases/models not created for public markets to reliably bet on. However, the largest consideration to make is the continued enhancements and innovation on blockchain technology itself and not a specific ‘coin’. As Interoperability is a fundamental guiding principle of Web3, all of these ‘coins’ will have to be exchangeable, however, the infrastructure that they are built and operate on is the most important aspect. In this case, from what I’ve read and listened to, Ethereum demonstrates a continued dedication towards innovation, and many other ‘coins’, protocols, and smart contracts are being built on top of it, in which case Ethereum appears to be the primary infrastructure for blockchains. Bitcoin is by and large a blockchain relic that has not been innovated however may hold sentimental, extrinsic value (similar to gold). A guiding principle will be to follow blockchain developers that are following the rules of interoperability and constantly improving the blockchain (as what was done with the Internet that allowed it to scale).\n   * The West Coast (more specifically California) will remain the innovation center of the US (if not the world)[v][w] and the companies that flee or begin hiring remote/outside of California will be Web2 companies (or later) that no longer need bleeding edge innovation for their business models (eg Tesla, Oracle, Salesforce, Microsoft, Google, Apple, etc)[x][y]. Companies or people that remain in Silicon Valley will be the next wave of innovators that capitalize on their networks, flow, entrepreneurship, and limited externalities (good weather and limited natural disasters).[z][aa]\n   * Schooling and University will slowly decline for White Collar tech jobs because finding the computer science type mind and allowing it to work as productively for as long as possible on innovations will be more valuable than the knowledge obtained at formal schools/universities (unless of course, they are the prestigious, network-driven universities such as Stanford, UCLA, etc).[ab][ac]\n* What this means for me and my career\n   * The Enterprise Web2 Companies provide the most amount of learning and growth opportunities in a non-Software-related role. Since there will be P&L crunches, their salaries will be less than when they were true market monopolies, however still significantly higher than lower-tier/commercial Web2 companies. Additionally, the ESOPs will be lucrative because they are not considered on balance sheets and the public market (that generally does not have access to Web3 privately held companies) accepts Enterprise Web2 companies as the highest growth and yield companies.\n   * Non-Enterprise Web2 Companies are on the ending Web2 Wave therefore they will be both technologically behind Enterprise Web2 companies and poorly positioned to make a jump to Web3. Additionally, because there will be increased competition among Web2 companies (since the skill sets needed in Web2 have been either largely automated, reduced barrier to entry or commoditized) there will be P&L crunches without the market leadership or revenue to justify higher salaries/equity options.\n   * Data - Since Blockchain and AI will be the next wave of innovation in Web3, technologies supporting them will become more important. Existing databases (SQL: 30+ years old, Postgres (25+), NoSQL (15+), GraphQL (10+) will become increasingly obsolete (in age order) due to the fundamental changes in ACID/BASE into SALT. Immutability and interoperability will vastly change the data landscape with Data Engineering and Data Science becoming the most sought-after data [ad]skill-sets while Analysts largely become commoditized through Web3 services.\n   * Web3 - skill sets needed and a transition plan\n      * Web3 companies will be going through Series A, B, or C funding. Series D+ largely indicates Web2 companies that have missed the technological wave and will not provide equity.\n      * Web3 companies focused on AI is the easiest jump for me however making the transition into an Individual Contributor (IC) role as opposed to Mgmt will be better long-term as I can continue to develop bleeding-edge tech skills that will allow me to switch back into Web2 or Web1 legacy enterprise companies as they procure Web3 technology/services[ae][af]\n      * Web3 companies focused on blockchain will be the most difficult jump for me however makes the most return/multiplier for future career growth. Getting into a Web3 company with equity in any role possible is the best career pivot for the impending evolution.[ag]</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-5",
    "title": "Web2 is Crashing, Web3 is Forming Differently",
    "body": "<div>\n<p>Further Thoughts - feel free to skip, these were emergent thoughts I had post load that are not fully articulated and developed:\n* Reserve currency was created because all it represented was the ability for a governance structure to balance the mechanisms to keep some proportion of the population meeting the lower hierarchy of needs. When an externality happens, it increases the people's demands to consume. The more complex/in-depth you can think, the more value you have. The less you think, it’s because you’re doing something for someone else. The Service Economy = the Thinking, Helping People Think or Lower Hierarchy Economy.[ah][ai]\n* US and China = a battle of network vs node, diversity vs monoculture which is why the US will innovate its way to victory. With my current mental map, I believe the fundamentals that Ray Dalio has outlined about long-term debt cycles and reserve currencies no longer apply as we are in an entirely new (albeit some similarities) paradigm. Network dependencies and effects are more prevalent than at any time in history which increases the propensity and probability of geopolitical collaboration among western democracies while at the same time these countries largely create and contribute to technological innovation. The push for Open Source in web3 is a competitive advantage to closed networks (Typically autocratic like China and Russia)\n* SaaS is dead and outdated, the next business model will be monetizing the key characteristics of Web3 - interoperability, AI, Blockchain, and AR/VR. There will be some similarities to conventional business models, Web1, Web2 but also completely new business models.[aj][ak]\n* Innovation Adoption Phases and Capital markets. VC funding at Innovators and Early Adopters while public markets are Early to Late Majority.\n* From Matt:\n   * Development flows as it relates to Web Waves eg Waterfall, Agile, etc\n   * Development languages and their changes/shifts</p>\n<p>Documents:\nhttps://www2.deloitte.com/us/en/insights/topics/digital-transformation/web-3-0-technologies-in-business.html\nhttps://www.macrotrends.net/states/california/population\nhttps://www.washingtonpost.com/news/capital-weather-gang/wp/2018/08/07/the-united-states-of-nice-days-heres-where-and-when-to-find-the-nations-most-frequent-ideal-weather/\nhttps://medium.com/@essentia1/why-the-net-giants-are-worried-about-the-web-3-0-44b2d3620da5\nhttps://medium.com/fabric-ventures/what-is-web-3-0-why-it-matters-934eb07f3d2b\nhttps://www2.deloitte.com/us/en/insights/topics/digital-transformation/web-3-0-technologies-in-business.html\nhttps://www.globallogic.com/insights/blogs/whats-an-a-player/\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2020/09/08/netflix-ceo-reed-hastings-on-high-salaries-the-best-are-easily-10x-better-than-average.html\nhttps://www.financialsamurai.com/candid-advice-for-those-joining-the-startup-world/\nhttps://www.linkedin.com/pulse/from-product-management-crypto-oliver-zerhusen\nhttps://www.paradigm.xyz/2021/09/the-community-garden-the-case-for-leaving-faang-companies-for-crypto/</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-6",
    "title": "ACID vs SALT: How Databases Mirror Generational Shifts",
    "body": "<div>\n<p>ToDo - Shift from Stream of Consciousness to narrow down:\n* Determine Target Audience\n   * What segments am I targeting and why?\n      * Early to Middle-Aged Professionals in the Tech or Finance related industries\n         * Most likely to seek career advice\n         * Most likely to seek investment advice\n         * May be applying to enterprise companies and unable to get an interview\n         * Maybe reading/hearing about Web3 but don't fully understand the history of the Web and future\n         * Maybe in a startup/younger company and assessing growth potential\n   * What value can be gained?\n      * Career advice\n      * Technical skills development plan\n      * Investment advice\n      * ‘Skating to where the puck is going to be vs where the puck is’\n   * What perceptions am I trying to create or change?\n      * Self-Confidence - the current job application process and lack of transparency create feelings of inadequacy or incompetence. Getting into a high-growth career has more to do with your network value than actual skills. This theory can give confidence back to those who have either applied or been rejected by Enterprise tech companies. Additionally, it can create self-confidence on what to learn, get involved in.\n      * It is never too late for a change - because we are at the building phase of the next wave, it is the perfect time to start leaning in and getting involved so that you can pivot.\n      * Continuous Learning and adaptability are key\n* Isolate the Objective\n   * What is the core, fundamental truth I am trying to center on?\n      * The skills and abilities that got us here are not necessarily going to be the ones that take us to the next step. You have to continuously evolve by learning and adapting to the changing times.\n   * What are the principles, models, and actions to be taken?\n      * Network over Node - leverage a network instead of relying on your innate ability or lack thereof\n      * Waves - are you on the shoreline, in the water, or paddling out?\n      * Webs - the industry balance of trades, handshakes, conflict are more about disruption and market positioning than the economic competition. Prior waves are connected to current waves.\n   * How does this endure (stasis or evolution)?\n      * This evolves into a few different methods:\n         * Conversations with people and their thoughts on this concept\n         * Conversations with people about their jobs\n            * How does it potentially relate to this concept\n            * Insights into their jobs to share with early-career people or those looking to pivot\n* Next Steps - where and how to ride the wave for me and others\n   * Potential Names:\n      * The Career Bootstrap Podcast\n      * Jobcast Podcast\n      * The Careerstrap Podcast\n      * J2C Podcast (Job-to-Career)\n      * Disruptive Career Podcast\n      * The Bulletin Podcast\n      * Careervice\n      * EntreCareer Podcast\n      * Let’s Chat Podcast\n      * Chat and Cheese Podcast\n         * “This is the chat and cheese podcast with Ryan Klauder, let’s chat it up and get this cheese! This week we have XXX joining us to talk about YYY.”\n      * The Walk n Talk Podcast\n   * Content Outline\n      * Start with Career Interviews\n         * Slowly focus in on emerging tech/VC\n         * Shift to Waves and Webs tech trends\n   * Content Schedule\n      * Weekly 40min interviews with various people and their jobs\n      * Background/History\n            * Need to give an elevator pitch of what the people do\n         * Tell me about your career so far\n         * Where do you sit in the organization\n         * How did you choose what you wanted to do\n         * School/Self-Taught\n         * What makes you wake up in the morning?\n         * Tell me about your average day\n         * How do you manage your time\n         * Tell me about your worst day\n         * Tell me about your best day\n         * What Jobs have you had\n         * What is the market function?\n         * Skills in Jobs\n         * What are some of the tools you use?\n         * Who do you work with the most\n         * Industry vs Function\n         * Aspirations 2-3 years\n         * Long-Term Vision\n         * What advice do you have for someone looking to move into this type of role?\n   * Distribution methods\n   * Engagement\n      * Facilitate Questions\n      * What could be affiliated content?\n   * 3-6mo milestones\n* Strengths to Focus on:\n   * Extremely complex concept and break it down into digestible parts\n   * Technology/Culture/Innovation/Industry/Careers follow Waves\n   * Historical aspects as it relates to today\n________________\nLayered Cake</p>\n<p>As blockchain technology has continued to evolve, so has the innovations of the technology itself. While I lack historical depth of the space, this is an attempt to understand the layered cake of blockchain layers, while describing potential applications and opportunities. Here a write up should be made discussing the various blockchain layers and how they might be compared to a stock exchange (NYSE) and market maker (Jane Street).\nWhy Traders and Regulators Will Want Blockchains\n   * Transparency\n   * Reduced Settlement Risk\n   * Decentralised Market Makers → increases trust\n[a]Possibly add a link to a resource that accurately reflects your perspective.\n[b]To be re-worked and reimagined\n[c]To be re-worked and reimagined\n[d]To be re-worked and reimagined\n[e]I see why you have this here, but I disagree with some aspects of this table in this chart. In my view, marketing becoming more technical has enabled an enormous amount of growth in Web 2.0 which has now jumped the shark and made an Ad-free/value-based/service Web 3.0 desirable.\n[f]Great point. I'm not considering that functions are evolving with the technology. This is an area I may have to think more deeply about.\n[g]To be re-worked and reimagined\n[h]I see why you have this here, but I disagree with some aspects of this table in this chart. In my view, marketing becoming more technical has enabled an enormous amount of growth in Web 2.0 which has now jumped the shark and made an Ad-free/value-based/service Web 3.0 desirable.\n[i]Great point. I'm not considering that functions are evolving with the technology. This is an area I may have to think more deeply about.\n[j]To be re-worked and reimagined\n[k]To be re-worked and reimagined\n[l]To be re-worked and reimagined\n[m]I have read most of this book and I agree with your reference. However, I feel much of what Thiel wrote re-packages \"Blue Ocean Strategy\".\n[n]Potential Further Thoughts content and outside of Waves and Webs initial content\n[o]Interested in what your thoughts on about Korea and Japan.</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-7",
    "title": "Positioning for the Next Wave",
    "body": "<div>\n<p>And what Richard said about China and privacy is something to wonder as covid s getting us to a place where to be safe we may need to give up some privacy.</p>\n<p>I was watching Korea cafe vlogs where you have to scan your personal QR code when you enter cafes and it helps the gov track where you are so if you get covid they can alert everyone else who have been where you’ve been. I feel like in the US, people would freak out if we had to do that.\n[p]I agree with including the influence of network effects in technology, but I think the Valley's greatest influence is in the past. China's fundamental advantage is unbelievably strong, but vulnerable at the same time for the same reason. The ability to violate people's privacy while harvesting tons of data is going to be interesting to watch as the world applies pressure on China as we become more aware of what our \"free\" apps actually cost.\n[q]I am a little lost on what this means.\n[r]Great call out, thank you! It's database transaction protocols.  The simplified version is https://www.usenix.org/conference/osdi14/technical-sessions/presentation/xie</p>\n<p>the fun version is https://collincusce.medium.com/blockchain-salt-a-descriptive-model-b19c973fef5f</p>\n<p>the technical version is:\nhttp://www.ise.tu-berlin.de/fileadmin/fg308/publications/2017/2017-tai-eberhardt-klems-SALT.pdf\n[s]Are you saying you’re too tired to write about this right now or …? 😆\n[t]_Marked as resolved_\n[u]_Re-opened_\nWas it resolved though 🤨\n[v]Why's this?\nNot sure if I fully agree. You mentioned earlier NYC was a hub for a while then things moved on to silicon valley. Could it be possible that the hub for web3 companies will be in a place (including being remote(or in the metaverse lol)) best suited for its needs? I believe the biggest factor is going to be which state/country has the most \"friendly\" tax rules/regulations surrounding crypto/blockchain tech.\nCalifornia already seems like a mess and companies + talent have been packing their bags and heading elsewhere (mainly Austin from what I understand)\n[w]At the individual level some talent has been leaving but as a whole (from the numbers I’ve read), it is exaggerated. Any metropolitan area will progressively have the issues California has (how do you democratically run a diverse, expansive populous) and increase taxes as public needs become more in demand from population growth. Ultimately I believe California has geographical advantages that make it a better place to live than Austin (or any area in Texas). Including but not limited to temperate weather, abundant food production, diverse natural resources/geography, and limited threats from natural disasters.\n[x]Not sure if these companies will ever take their foot off the gas and allow competition to catch up. They're always going to search for the new edge in innovation or be the ones creating it.\n[y]I think natural processes will cause this to happen. Web2 companies have largely enjoyed monopolies in their fiefdoms, which is quickly changing as they are engaging in the same markets. This will cause them to become more competitive in new ways but also in price (which hasn’t been a concern for them the past decade). When they compete on cost and as the market becomes saturated, they’ll lose talent and their innovation edge.\n[z]Are you moving to California??? lol I think you are missing the kind of tech communities in cities like Chicago, Raliegh, and Austin. All of these cities have a lower cost of living, less exposure to natural disasters, and thriving talent bases that are able to put down roots there.\n[aa]I definitely agree but my 'theory' is that by and large the trend will still favor California. While Chicago, Raleigh, Austin (hell even Miami, Phoenix, Denver) will continue to grow, those cities are in more competition with a NYC as opposed to becoming a full-fledged tech and innovation hub like Silicon Valley.\n[ab]While I agree that fewer people will go to college for technical jobs in favor of apprenticeships, but development is already very open to people that are self-taught. I am not sure how you tie this to Web 3.0 per se.\n[ac]Thanks for the feedback. I'm realizing this is an unfinished thought but my premise is that school is a rent-seeking, 'walled garden' at its core. How it links to Web3 is in interoperability. Right now there are a lot of industries/jobs one simply cannot move into because they didn't get a degree. I see this as being completely broken in Web3.0 because it does not conform to 'interoperability'. Another reason why I see Waves conforming or following database transaction laws/protocols.\n[ad]So true.\n[ae]definitely going to be valuable\n[af]I don't think there is any debate on how valuable technical/cognitive flexibility will be.\n[ag]It depends on what you want to do within those orgs. Blockchain as a tech stack has so many potential applications as hacks increase in scope and complexity. If you can find a Web 3.0 friendly company that is in a \"Zero\" position with an opportunity they do not see the \"One\" position coming you might be able to get in a position to lead an opportunity you see.\n[ah]You are a little non-sequitur in this bullet point. I'm not sure how the second clause connects to the first. It could just be a case of me misreading it.\n[ai]My apologies as Further Thoughts were things for future consideration and commentary that I jotted down. Sorry for not mentioning!\n[aj]Why is this at the end??? While I would say \"SaaS\" is an imbalance(Saas) with a greater focus on software with bolted on service. The long-tail value creation is the most compelling reason to create a service mindset to smooth together the technologies noted and whatever comes next.\n[ak]Late night hyperbole on my part :D</p>\n<p>What I mean here (and to think more deeply about) is that SaaS being 'THE' business model is dead. As you perfectly put, it has evolved to incorporate bolted on services lines of business. For Web3.0 companies SaaS IMO is diametrically opposed because it does not allow for interoperability, the data exchange needs for AI nor the intensive infrastructure and computing needs for AR/VR.</p>\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  }
]