[
  {
    "id": "waves-and-webs-part-1",
    "title": "Waves and Webs: Rethinking Innovation",
    "body": "<div>\n## Part 1: Waves and Webs: Rethinking Innovation\n\nWAVES AND WEBS\n\nAs you look to the ocean, imagine consecutive and infinite waves \\- building, rolling, and crashing. Each wave has its small part in the wave before and after it, leaving remnants of its strength and disruption. I imagine technological innovation in the same way, consecutive waves building, rolling, and crashing. Each crash creates foamy disorientation for the people, governments, and markets to concentrate on the innovation, business models, and rules of engagement. The beginning of each s-curve in the building phase of the nascent, albeit exponential, tech innovation. In this stage, perception of disruption, progress, and adoption appears linear. As you roll through this perception from early adoption, the rate of change begins to rise and everything is disrupted. Just as soon as you adjust to the rapid change, the wave starts to plateau and crash. While the water recedes, the next wave gathers its strength… That is where I believe we are right now. This is my attempt to determine what is the shoreline, the washout, and paddling out.\n\nWorking in the data world for as long as I have, thinking analytically and loving a good story naturally leads me to dive deeper. It means that I’m always looking for the patterns and underlying ‘why’ behind what I see happening. I became enamored with this idea of market orientations, demographics, and innovation trends. It’s been a combination of how VCs look at businesses (via my own professional experience), top-tier VC investment flows (Y Combinator, Tiger Global, A16z), and researching emergent Web3 technologies. It’s been a culmination of articles, podcasts, videos, and books I’ve read over the past few years that have resulted in a fundamental shift in my perspective.\n\nI apologize in advance for all of the conjecture, I haven’t had enough time to fully document and annotate. It’s difficult to reflect on which media type formulated these ideas so take it all in grains and grays.\n\nAssumptions before reading:\n\n* You know what Web 1, 2, and 3 means (if not, pls google)\n\n* You have a general sense that software engineering/development is not an easy career to move into. There is a high barrier to entry and the abstract knowledge needed is concentrated on a finite talent pool.\n\n* You generally understand the concept of white vs blue-collar jobs and understand what commodities are (for intents and purposes I think of unskilled labor as commodities). Think of White Collar, Blue-Collar and Commodities in terms of their value and complexity:\n\n* White-collar (highly-skilled/most difficult) provides the highest value with low supply\n\n* Blue-Collar (semi-skilled/medium difficulty) provides moderate value with moderate/high supply (depending on the s-curve phase)\n\n* Commodity (low skilled, low to no difficulty) provides moderate/low value with high supply. Something to note, commodities by nature are usually concentrated to highly competitive (and therefore low margin or income) and appear to be susceptible to contractor/part-time workforces as well as incentive-based pay as opposed to salary.\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-2",
    "title": "Atlantic vs Pacific: A Tale of Mindsets",
    "body": "<div>\n## Part 2: Atlantic vs Pacific: A Tale of Mindsets\n\n* You generally understand that a lot (and most likely the majority) of the ‘bleeding edge’ tech community lives in California (for various reasons that we will get into)\n\n* You have heard about blockchain and AI (but you don't need to know too much about the specifics and nuances of them)\n\n* You know that the biggest tech companies (as of the last decade which is considered the Web2 era) are generally Facebook, Apple, Amazon, Netflix, Google, etc. An assumption I have is that they are fundamentally only enterprise Web2 companies with an innate inability to transition to Web3 (which we are on the cusp of). The recent regulatory scrutiny and efforts to create ‘walled gardens’ by these Enterprise Web2 companies are indicative of increased competition as their technological innovations have peaked/crashed ( at top of s-curve). You’ve seen a convergence of portfolios and products by these Enterprise Web2 companies as well as a ‘rubbing of elbows’ with each other in their respective markets (eg podcasts, video, streaming, devices, etc). This has created a format war as they seek to create technological barriers, ‘Walled Gardens’, or ‘moats’,  that lock in users and customers into their platforms/ecosystems.\n\n* Entrenched legacy companies and business models create incentives for innovation and thereby disruption. For myriad reasons (public markets and financial regulation, increased competition, organizational maturity) companies create ‘walled gardens’ and ‘moats’ that are diametrically opposed to the original mission or value at the beginning of each innovation wave. In the latest example, the Web2 era has incentivized and created these interoperability problems which Web3 seeks to disrupt. Web2 companies cannot lead these innovations because they are fundamentally counter to their business models and entrenched market positions. While some may shift, most will not. My thoughts are that there could be a fundamental shift in business models for Web3 (that favor public, social transactions of value) that could have some semblance to contemporary and prior business models but will almost be entirely new.\n\n* Open Source Technology development has largely been funded at the individual level, through VCs or through Web2 Enterprise Companies.\n\n* Technological evolutions largely move in Waves however thinking conceptually, there are these Webs connecting previous Waves. This is demonstrated with Web2 companies providing the ability for Enterprise Web1 to survive because these Enterprise Web1 companies have the budget and balance of trade leverage needed to fund Web2 companies. You will see the same happen with Web3 (for example Web1 Verizon teaming with Web2 Google and Apple for software/hardware during the Web2 era). What this means is that as the most recent wave builds, market positioning starts to occur with the balance of trades and partnerships between previous waves primarily due to infrastructure and capital.\n\n* My theory is that technological innovation is primarily centered on improving the network performance of humanity. From the printing press, trains, cars, internet, social media, etc the broadest and disruptive technologies have all been rooted in one way or another to improve the transmission of information. As these innovations have been adopted, the world has appeared to become more complex (or dense). Thinking of it this way, the world is performing more like a network that mirrors our online interactions. In many ways, our Offline-to-Online (OTO) lives are the most deeply connected they have ever been. As the perceived complexity of reality (Offline) grows (with political structures, corporate structures, career skill sets, etc), it is imagined that the digital (Online) complexity increases as well.\n\n| Phase | Web1 |  | Web2 |  | Web3 |  |\n\n| :---- | :---- | :---- | :---- | :---- | :---- | :---- |\n\n| Role Type | Non-Tech | Tech | Non-Tech | Tech | Non-Tech | Tech |\n\n| White Collar | Marketing/Sales/Services | Software Engineering | Marketing | Software Engineering | Marketing | Software Engineering/AI |\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-3",
    "title": "The Great Migration of Talent",
    "body": "<div>\n## Part 3: The Great Migration of Talent\n\n| Blue Collar | Finance | Web Dev | Sales/Services | Data/Analytics | Sales | AI/ML |\n\n| Commodity | Manual Labor |  | Finance Web Dev | Data Engineering | Sales/Services Finance | Data/Analytics Data Engineering |\n\nAssumptions on History and Thoughts\n\n* A ‘Mindset’ Novella\n\n* Atlantic\n\n* Thinking of the settlement of the East Coast of America, one could characterize it by short, waypoint-like travel. Established settlements evolved into cities across the east that became dense and bustling. These cities largely grew and built off of the Industrial Revolution by incorporating disruptive technology (combustion engine) into the economy. Innovations were largely incremental or waypoint-like improvements that were quickly copied and spread which led to increased competition.  By and large, from the 40s-90s New York reigned supreme as a financial hub but also an innovation center for utilities, both of which quickly faced intense competition. What is key to think about is that the settlement and development of the Atlantic Coast resemble incremental improvements brought on by increased competition in dense (or saturated) markets. In this way, I define this as an “Atlantic Mindset”.\n\n* Pacific\n\n* Expansion of America to the West Coast was primarily driven by the desire for more opportunity \\- pioneering new or better ways of life. This coalesced into the migration to the Pacific Coast. The West Coast is characterized by long distances both figuratively and literally. Three states make up the entire West Coast while there are more than double across the East Coast. Anecdotally, it took a great deal of effort and grit to go westward as well as endurance because its geographic location isolated it from the East Coast, Europe, and Asia. While many moved west in search of gold, you don't really see a big influx of population until the flight from the more urban East Coast cities during the 70s-90s. Despite this, the premise remains the same \\- people searching for new opportunities and pioneering new ways. Out of play from the Finance and Utility industries thousands of miles away, innovations would need to be centered around scalability which led to less competition and more market concentrations. What is key to think about is how the settlement and survivability of the westward expansion were far-reaching, exploratory, and discovery. In this way, I define it as a “Pacific Mindset”.\n\n* The Great Knowledge Migration and Concentration\n\n* New York and Financial Engineering\n\n* While New York would be known as the epicenter of finance, business, and networking; it was truly incremental changes to existing creations. Finance innovations took what has been done for decades (if not centuries) and incrementally improved them to include M\\&As, Stock manipulations, derivatives, financing models, etc. which were conceptually new waypoints. The competition was fierce in this era because it was primarily based on capital manipulations or infrastructure upgrades that could be replicated and adapted relatively quickly. During the ‘80s and ‘90s, finance was the premier industry where most of the smartest minds made lots of money to figure out the best way to game the economic machine. Technical innovation to ‘feed the beast’ that was Wall Street (limit downtime, improve trade/communication speeds, improve resiliency). This primarily led to massive investments (public and private) into finance companies (which manipulated capital), utilities (which built the physical infrastructure for Wall Street), and data/network (which vastly increased flows and volume). Even with these technological adoptions, from a macro perspective, New York had its downsides in frequent disruptive weather events, legacy infrastructure, seasonal weather variability, established social, socioeconomic, and political classes; all of which were maintenance-heavy. The story I see is that as technology evolved into Web1, innovations were adopted primarily to improve finance companies, utilities, and data/network performances. What you see in the Web2 era is that those industries (but mostly finance and data/network) by and large became Marketing/Sales/Services oriented because most of it could be automated. To exemplify this, think more specifically about ETFs which by and large provide better returns (after cost) than actively managed funds. That analysis and market adoption was proved after extensive research on historical data used from Web1 and Web2 investment platforms to allow widespread adoption. In my mind what this also showed us that the financial innovations during this time were incremental and not truly revolutionary because the value creation was linear (look at S\\&P 500 growth) which is also a result of increased competition. True ownership multipliers, therefore, lie in the innovation and creation of new markets through new technologies (which often come with higher risk levels that public markets and public funds cannot accept).\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-4",
    "title": "The A-Player Cascade",
    "body": "<div>\n## Part 4: The A-Player Cascade\n\n* Silicon Valley and Software Engineering\n\n* The true innovation was happening in California where a “Pacific mindset” of pioneering took hold. A lot of this was possible because of an expansive metropolitan area that allowed for less competition (think of Thiel and his views on monopolies in Zero to One) which allowed for breakthroughs in the practical use of R\\&D (which were largely protected from outright, direct competition) as well as the ability to test these technological breakthroughs with less downtime from storms/power outages. Since this technological pioneering had broad and revolutionary applications, there was a flurry of talent and money to cash in (from a refined Finance industry that had become incestuous searching for yields). The first sign of how truly revolutionary this technology was (and how fragmented from reality the Finance industry’s perspective on it was) is to look at the Dot Com bubble/burst. A truly revolutionary technology went live but the market propensity to understand the implications was so far removed that it resulted in a classic bubble. However, what this truly did was to supercharge the coming Web revolution that would survive Web1, evolution to Web2, and expected Web3 revolution. As Sean Parker famously said to a young Mark Zuckerburg “You have to move to California” which is exactly what has happened not only to tech VCs, but all of the most well-known tech staff, executives, and founders. The West Coast (and more specifically California) has had the brightest and most innovative minds for most of the Web1 and practically all of the Web2 evolution. With a focus on pioneering (Pacific Mindset). Is there any wonder why ‘software is eating the world’ and ‘disrupt everything’ became rallying cries? In this perceived (but in some ways \\- actual) utopia, growth was unprecedented because the technological innovations were unprecedented and occurred at a rapid pace. Web1 tech companies (Microsoft, AOL, Yahoo, etc) became the legacy players that became disrupted and eaten by Web2 (Apple, Google, Amazon, etc). As with every wave, came a significant shift in the job market as skill sets quickly became either outdated or completely automated in the  Blue Collar/White Collar/Commodity table. Tech and Non-Tech Blue Collar jobs that carried even moderate labor costs were quickly automated (commoditized) and what couldn't, carried over to the Web2 Tech/Non-Tech Blue Collar jobs. All the while through Web1 and Web2, the West Coast (and more specifically San Francisco) has been and will continue to be the epicenter for technical innovation. The bleeding edge tech revolution will continue to stay on the West Coast while the East Coast (and middle America) will battle to take the scraps.\n\n* A 10x Jobs Theory\n\n* “Steve Jobs used to say, to the point we all got sick of hearing it: “A players attract A players. B players attract C players.” This was in the context of making each new hire count, from the most junior to the most senior, regardless of role.” \\- Jim Walsh. This concept has been universally adopted by the biggest and best tech companies. Even Netflix’s Reed Hastings famously said “the best is easily 10x better than average”, which really echoes Jobs' original theory. Not only does this theory seem to have been a large reason for why top talent has become and will remain concentrated, but it’s also why PE firms, recruiting companies, and the like have all implemented psychometrics as part of the hiring funnel. Why? Enterprise Web2 and Web3 companies have and will continue to sap top engineering, data, and finance talent from the market as Jobs’ “A following A theory” continues to play out. Think about it, if you were one of the brightest in your industry, your greatest potential is to work with the brightest of the brightest, therefore to work on truly challenging and revolutionary work, you will go where the brightest are. What this top talent concentration has done is create the need for mid/low tier companies to try to weed out the remaining As from the marketplace, in futile attempts to build top tier technology/companies to be acquired. Vista has very famously implemented Criteria Corps CCAT which classifies individuals into A, B, C, and D based on their critical thinking skills and problem-solving ability among other attributes. Vista primarily looks to buy, pump and dump companies but after implementing these psychometrics to attract top tier firms to buy. As I have seen personally with every portfolio company, they do a pre/post-acquisition CCAT analysis of leadership and staff, broken out by Tech and Non-Tech positions. From my reading, most of the top-tier companies either recruit based on Referrals (following the A follows A theory) or those that pass psychometric tests (which discovers stray As in the marketplace). Based on this info, a concentration of A people in tech companies will likely continue as A attracts A in Enterprise Web2 and emerging Web3 but also as more firms implement psychometrics and become even more selective in their hiring processes.\n\n* Network Effects\n\n* America/Europe/Asia as it relates to tech phases\n\n* From what I’ve seen, a lot of the tech innovations typically flow from the West Coast to the East and end in China. While China has significantly improved its tech standings, it has not proven itself to be a pioneer in Web3 technologies (though it is catching up in AI).\n\n* Data and technological phases of companies (ACID, BASE, SALT)\n\n* Looking at different structured and unstructured databases, they have generally followed different transaction principles: ACID (the 70s-00s), BASE (00s-10s), and SALT (10s-now). What I’ve seen is that tech companies appear to get stuck at database transaction principles they lived off of during their Web era which limits their ability to evolve for the next Wave. Looking at Legacy Web1 companies (Verizon, SAP, Oracle, Microsoft, etc) they primarily used ACID constrained database transactions which shaped and limited their abilities to innovate into the needs of Web2. Google, Facebook, Amazon primarily utilized BASE-constrained database transactions because that was what was needed for Web2 and their business models however this created the use-case for SALT which is indicative of Web3 and blockchain. What is striking is that companies' existing business models appear to mirror their database transaction principles which constrain them from a ‘Zero to One’ innovation. Web1 prized Accuracy, Consistency, and Isolation of transactions however this inhibited scalability of those systems which is why Microsoft, Oracle, Salesforce built database and software moats that did not allow for interoperability because of the fidelity of transactions was paramount. Their business models reflected this as they mostly did not allow data off-platform and had custom development languages (T-SQL, Oracle SQL, and SOQL) and inflexible database technology (Eg OBIEE, SQL Server, SF Objects) that did not provide the tools necessary for a more dynamic, fast-paced Web2. Looking at Web2, more specifically \\- Google, Amazon, and Facebook fundamentally needed BASE transaction constraints because transaction availability and soft state adaptability were needed as data volumes increased exponentially and performance needed to scale with growth. However, the inconsistency and soft state create distrust which does not allow for interoperability out-of-ecosystem (or out of the walled garden) which is why blockchain (SALT) has become more important. What SALT provides is distributed performance with higher levels of data fidelity and trust between transactions that address ACID and BASE gaps. Therefore distributed and open source is contrary to and addresses the gaps in ACID (Web1) and BASE (Web2) database transaction models. Fundamentally I believe databases and database transactions are closely (if not at the core) of how tech businesses in each Wave are modeled because optimizing transactions allows for companies to break paradigms and unlock rent-seeking value from the previous Wave. Since database performance is at the core of the system and network performance (because it represents information fidelity, throughput, and market demands), technological innovations will lead and inform Web business models in each Wave.\n\n* Network Complexity as it relates to skills and White/Blue Collar jobs/innovations (too tired…)\n\n* Web2 as it evolves to Web3\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-5",
    "title": "Web2 is Crashing, Web3 and AI Are Forming — Very Differently",
    "body": "<div>\n## Part 5: Web2 is Crashing, Web3 is Forming Differently\n\n* Web2 companies are mostly all publicly traded companies. This fundamentally shifts their business interests and ability to throttle P\\&L to spend on R\\&D which will not allow them to lead Web3 innovation. Shareholders’ demands for profitability and the corporatization of these organizations come at a time when their product ecosystems are rubbing elbows (and increasing competition in format war) which further reduces profit margins as price and not technology become competitive advantages. These companies are already starting to throw out their Web2 armistice agreements, reduce labor costs, improve profitability and create ‘walled gardens’ because Web3 will fundamentally disrupt their business models. Therefore the most successful Web2 companies will either be/go private (so that they can incur these painful changes and adapt) or they will drastically improve profitability to try to buy their way into Web3 (the way Microsoft has been able to survive Web1 to Web2) and/or own and provide the infrastructure (Cloud/Computing/Own Data). With the Jobs Theory of “A follows A”, the smartest engineers will start to pursue Web3 development and you can already see this happening as top talent flees these tech companies and Enterprise Web2 companies shift to hiring sprees for tech/non-tech blue-collar positions (Services, Sales, Data Analysts, Program Managers, etc).\n\n* Web3 companies will be funded by Web2 founders, innovators, and winners (both individuals and VCs) that will create a new class of Web3 tech monopolies. This includes Jack Dorsey, Elon Musk, A16z, Y-Combinator, Tiger Global, etc. Enterprise Web2 companies will create strategic alignments and balances of trade with Web3 companies to protect moats while Web3 companies generate the revenues for growth and get scalable infrastructure.\n\n* Cryptocurrency is a funding mechanism for blockchain development in Web3 because these companies (largely open-source organizations) fundamentally cannot go public. It mirrors the Dot Com bubble in that its implications are not clearly understood and business cases/models not created for public markets to reliably bet on. However, the largest consideration to make is the continued enhancements and innovation on blockchain technology itself and not a specific ‘coin’. As Interoperability is a fundamental guiding principle of Web3, all of these ‘coins’ will have to be exchangeable, however, the infrastructure that they are built and operate on is the most important aspect. In this case, from what I’ve read and listened to, Ethereum demonstrates a continued dedication towards innovation, and many other ‘coins’, protocols, and smart contracts are being built on top of it, in which case Ethereum appears to be the primary infrastructure for blockchains. Bitcoin is by and large a blockchain relic that has not been innovated however may hold sentimental, extrinsic value (similar to gold). A guiding principle will be to follow blockchain developers that are following the rules of interoperability and constantly improving the blockchain (as what was done with the Internet that allowed it to scale).\n\n* The West Coast (more specifically California) will remain the innovation center of the US (if not the world) and the companies that flee or begin hiring remote/outside of California will be Web2 companies (or later) that no longer need bleeding edge innovation for their business models (eg Tesla, Oracle, Salesforce, Microsoft, Google, Apple, etc). Companies or people that remain in Silicon Valley will be the next wave of innovators that capitalize on their networks, flow, entrepreneurship, and limited externalities (good weather and limited natural disasters).\n\n* Schooling and University will slowly decline for White Collar tech jobs because finding the computer science type mind and allowing it to work as productively for as long as possible on innovations will be more valuable than the knowledge obtained at formal schools/universities (unless of course, they are the prestigious, network-driven universities such as Stanford, UCLA, etc).\n\n* What this means for me and my career\n\n* The Enterprise Web2 Companies provide the most amount of learning and growth opportunities in a non-Software-related role. Since there will be P\\&L crunches, their salaries will be less than when they were true market monopolies, however still significantly higher than lower-tier/commercial Web2 companies. Additionally, the ESOPs will be lucrative because they are not considered on balance sheets and the public market (that generally does not have access to Web3 privately held companies) accepts Enterprise Web2 companies as the highest growth and yield companies.\n\n* Non-Enterprise Web2 Companies are on the ending Web2 Wave therefore they will be both technologically behind Enterprise Web2 companies and poorly positioned to make a jump to Web3. Additionally, because there will be increased competition among Web2 companies (since the skill sets needed in Web2 have been either largely automated, reduced barrier to entry or commoditized) there will be P\\&L crunches without the market leadership or revenue to justify higher salaries/equity options.\n\n* Data \\- Since Blockchain and AI will be the next wave of innovation in Web3, technologies supporting them will become more important. Existing databases (SQL: 30+ years old, Postgres (25+), NoSQL (15+), GraphQL (10+) will become increasingly obsolete (in age order) due to the fundamental changes in ACID/BASE into SALT. Immutability and interoperability will vastly change the data landscape with Data Engineering and Data Science becoming the most sought-after data skill-sets while Analysts largely become commoditized through Web3 services.\n\n* Web3 \\- skill sets needed and a transition plan\n\n* Web3 companies will be going through Series A, B, or C funding. Series D+ largely indicates Web2 companies that have missed the technological wave and will not provide equity.\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-6",
    "title": "ACID vs SALT — How Databases Mirror Generational Shifts",
    "body": "<div>\n## Part 6: ACID vs SALT: How Databases Mirror Generational Shifts\n\n* Web3 companies focused on AI is the easiest jump for me however making the transition into an Individual Contributor (IC) role as opposed to Mgmt will be better long-term as I can continue to develop bleeding-edge tech skills that will allow me to switch back into Web2 or Web1 legacy enterprise companies as they procure Web3 technology/services\n\n* Web3 companies focused on blockchain will be the most difficult jump for me however makes the most return/multiplier for future career growth. Getting into a Web3 company with equity in any role possible is the best career pivot for the impending evolution.\n\nFurther Thoughts \\- feel free to skip, these were emergent thoughts I had post load that are not fully articulated and developed:\n\n* Reserve currency was created because all it represented was the ability for a governance structure to balance the mechanisms to keep some proportion of the population meeting the lower hierarchy of needs. When an externality happens, it increases the people's demands to consume. The more complex/in-depth you can think, the more value you have. The less you think, it’s because you’re doing something for someone else. The Service Economy \\= the Thinking, Helping People Think or Lower Hierarchy Economy.\n\n* US and China \\= a battle of network vs node, diversity vs monoculture which is why the US will innovate its way to victory. With my current mental map, I believe the fundamentals that Ray Dalio has outlined about long-term debt cycles and reserve currencies no longer apply as we are in an entirely new (albeit some similarities) paradigm. Network dependencies and effects are more prevalent than at any time in history which increases the propensity and probability of geopolitical collaboration among western democracies while at the same time these countries largely create and contribute to technological innovation. The push for Open Source in web3 is a competitive advantage to closed networks (Typically autocratic like China and Russia)\n\n* SaaS is dead and outdated, the next business model will be monetizing the key characteristics of Web3 \\- interoperability, AI, Blockchain, and AR/VR. There will be some similarities to conventional business models, Web1, Web2 but also completely new business models.\n\n* Innovation Adoption Phases and Capital markets. VC funding at Innovators and Early Adopters while public markets are Early to Late Majority.\n\n* From Matt:\n\n* Development flows as it relates to Web Waves eg Waterfall, Agile, etc\n\n* Development languages and their changes/shifts\n\n* Webs \\- the industry balance of trades, handshakes, conflict are more about disruption and market positioning than the economic competition. Prior waves are connected to current waves.\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  },
  {
    "id": "waves-and-webs-part-7",
    "title": "Positioning for the Next Wave",
    "body": "<div>\n## Part 7: Positioning for the Next Wave\n\n* How does this endure (stasis or evolution)?\n\n* This evolves into a few different methods:\n\n* Conversations with people and their thoughts on this concept\n\n* Conversations with people about their jobs\n\n* How does it potentially relate to this concept\n\n* Insights into their jobs to share with early-career people or those looking to pivot\n\n# Layered Cake\n\nAs blockchain technology has continued to evolve, so has the innovations of the technology itself. While I lack historical depth of the space, this is an attempt to understand the layered cake of blockchain layers, while describing potential applications and opportunities. Here a write up should be made discussing the various blockchain layers and how they might be compared to a stock exchange (NYSE) and market maker (Jane Street).\n\n##\n\n# Why Traders and Regulators Will Want Blockchains\n\n* Transparency\n\n* Reduced Settlement Risk\n\n* Decentralised Market Makers → increases trust\n</div>",
    "tags": [
      "waves and webs",
      "career",
      "innovation",
      "strategy"
    ]
  }
]